package com.javarush.task.task04.task0415;

/* 
Правило треугольника
Ввести с клавиатуры три числа а, b, c - стороны предполагаемого треугольника.
Определить возможность существования треугольника по сторонам.
Результат вывести на экран в следующем виде:
"Треугольник существует." - если треугольник с такими сторонами существует.
"Треугольник не существует." - если треугольник с такими сторонами не существует.

Подсказка:
Треугольник существует только тогда, когда сумма двух его сторон больше третьей.
Требуется сравнить каждую сторону с суммой двух других.
Если хотя бы в одном случае сторона окажется больше либо равна сумме двух других, то треугольника с такими сторонами не существует.


Требования:
1. Программа должна считывать три числа c клавиатуры.
2. Программа должна выводить текст на экран согласно условия задачи.
3. Если треугольник с такими сторонами может существовать, необходимо вывести текст: "Треугольник существует."
4. Если треугольник с такими сторонами не может существовать, необходимо вывести текст: "Треугольник не существует."
*/

import java.io.*;


public class Solution {
    public static void main(String[] args) throws Exception {

       BufferedReader r = new BufferedReader(new InputStreamReader(System.in));
       String a1 = r.readLine();
       String b1 = r.readLine();
       String c1 = r.readLine();
       int a = Integer.parseInt(a1);
       int b = Integer.parseInt(b1);
       int c = Integer.parseInt(c1);

       if (a < b + c && b < c + a && c < a + b)
           System.out.println("Треугольник существует.");
       else
           System.out.println("Треугольник не существует.");
    }
}